Autodesk.Revit.DB.SymbolGeometryId.AsIdentifier
This will convert the SymbolGeometryId to a string that can be used in comparisons to check if two instances point to the same piece of geometry managed by the same symbol element.
Returns:
Returns a string that can be used in comparisons to check if two instances point to the same piece of geometry managed by the same symbol element.
Since:
2023

Autodesk.Revit.DB.SymbolGeometryId.AsUniqueIdentifier
Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.
Returns:
A string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.
Since:
2023

Autodesk.Revit.DB.SymbolGeometryId.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SymbolGeometryId.SymbolId
The id of the symbol that is containing the shared geometry.
Since:
2023

Autodesk.Revit.DB.SymbolGeometryId
This class is used to identify a piece of geometry managed by a symbol element.
Remarks:
This class can be used to compare if two instances points to the same piece of geometry managed by a symbol element.
The string returned by AsIdentifier can be used to achieve this.
Since:
2023